


#ifndef _DRIVE_7289_H_
#define _DRIVE_7289_H_


/*********************************************************************************************************
  包含头文件
*********************************************************************************************************/
#include "hw_memmap.h"
#include "hw_types.h"
#include "sysctl.h"
#include "gpio.h"
#include "type.h"


/*********************************************************************************************************
  PA端口定义
*********************************************************************************************************/
#define CS_7289       GPIO_PIN_2
#define CLK_7289      GPIO_PIN_3
#define DIO_7289      GPIO_PIN_4
#define KEY_7289      GPIO_PIN_5


/*********************************************************************************************************
 可以供外部函数申明
*********************************************************************************************************/
extern void Cmd_7289(char  cmd);                                     /*  执行ZLG7289 纯指令          */
extern void CmdDat_7289 (uchar  cmd, char  data);                     /*  执行ZLG7289 带数据指令      */
extern void Download_7289 (uchar mode, char number, char dp, char data); /*  下载数据                    */
extern char KeyDrive_7289(void);                                           /*  读按键值                    */
extern void Init_7289(void);                                          /*  ZLG7289 初始化              */


/*********************************************************************************************************
  ZLG7289用户指令集
*********************************************************************************************************/
#define Reset_7289()      Cmd_7289(0xA4)                            /*  复位(清除)指令              */
#define Test_7289()       Cmd_7289(0xBF)                            /*  测试指令                    */
#define SHL_7289()        Cmd_7289(0xA0)                            /*  左移指令                    */
#define SHR_7289()        Cmd_7289(0xA1)                            /*  右移指令                    */
#define ROL_7289()        Cmd_7289(0xA2)                            /*  循环左移指令                */
#define ROR_7289()        Cmd_7289(0xA3)                            /*  循环右移指令                */

#define Flash_7289(number)    CmdDat_7289(0x88, (number))                   /*  闪烁控制                    */
                                                                        /*  number的8个位对应数码管的8个位  */
                                                                        /*  0:闪烁  1:不闪烁            */

#define Hide_7289(number)     CmdDat_7289(0x98, (number))                   /*  消隐控制                    */
                                                                        /*  number的8个位对应数码管的8个位  */
                                                                        /*  0:消隐  1:显示              */

#define SegOn_7289(cSeg)  CmdDat_7289(0xE0, (cSeg))                 /*  段点亮指令                  */
                                                                        /*  8个数码管被看成64个独立LED  */
                                                                        /*  cSeg: 0 ～ 63               */

#define SegOff_7289(cSeg) CmdDat_7289(0xC0, (cSeg))                 /*  段关闭指令                  */
                                                                        /*  8个数码管被看成64个独立LED  */
                                                                        /*  cSeg: 0 ～ 63               */

#endif
/*********************************************************************************************************
  END FILE
*********************************************************************************************************/
